rocksdb/experiments/M2/results/20260429-025838/budget_on/run_3/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 03:08:23 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777432103789910 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.353 micros/op 119711 ops/sec 41.767 seconds 5000000 operations;  118.7 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      12.973 micros/op 77083 ops/sec 64.865 seconds 5000000 operations;   76.5 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      14.146 micros/op 70689 ops/sec 70.732 seconds 5000000 operations;   70.1 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     18/17   1.09 GB   0.2      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    433.8     34.46             27.98       240    0.144       0      0       0.0       0.0
  L1     16/16  978.29 MB   0.0     25.7    13.5     12.1      22.8     10.6       0.0   1.7    262.5    233.0    100.07             84.66        20    5.003     26M  2927K       0.0       0.0
  L2     90/0    4.51 GB   1.8     21.8     9.1     12.7      16.6      3.9       0.6   1.8    306.7    234.0     72.68             60.39       141    0.515     22M  5250K       0.0       0.0
 Sum    124/33   6.56 GB   0.0     47.4    22.6     24.8      54.0     29.2       0.6   3.7    234.3    266.8    207.21            173.03       401    0.517     48M  8178K       0.0       0.0
 Int      0/0    0.00 KB   0.0     47.4    22.6     24.8      53.7     28.9       0.6   3.8    235.4    266.5    206.24            172.19       396    0.521     48M  8178K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     47.4    22.6     24.8      39.4     14.6       0.0   0.0    281.1    233.4    172.75            145.05       161    1.073     48M  8178K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    433.8     34.46             27.98       240    0.144       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 177.4 total, 174.4 interval
Flush(GB): cumulative 14.598, interval 14.293
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 53.98 GB write, 311.62 MB/s write, 47.42 GB read, 273.75 MB/s read, 207.2 seconds
Interval compaction: 53.67 GB write, 315.21 MB/s write, 47.42 GB read, 278.47 MB/s read, 206.2 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 23, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 23, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 23, total-stops: 0
interval: 23 total count
Block cache LRUCache@0x55c0cddb4df0#80573 capacity: 32.00 MB seed: 690529622 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000168 secs_since: 177
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 177.4 total, 174.4 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 85.16 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 85.16 MB/s
Cumulative stall: 00:00:50.830 H:M:S, 28.7 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14738.02 MB, 84.52 MB/s
Interval WAL: 14M writes, 0 syncs, 14634403.00 writes per sync, written: 14.39 GB, 84.52 MB/s
Interval stall: 00:00:50.830 H:M:S, 29.2 percent
Write Stall (count): write-buffer-manager-limit-stops: 0